       IDENTIFICATION DIVISION.
       PROGRAM-ID. test-customer-filterer.
       PROCEDURE DIVISION.
           
           CALL 'customer-filterer' USING '03-05'.

           
           
           
           
           
           
