       IDENTIFICATION DIVISION.
       PROGRAM-ID. My_Celebrator.
       PROCEDURE DIVISION.
           DISPLAY "Happy Birthay!".
           DISPLAY "How was your day?".
           DISPLAY "I'm alright though, it's pretty cool this COBOL" 
           " stuff isn't it. I'm not sure what the weather is" 
           " going to be like tomorrow though?".