       IDENTIFICATION DIVISION.
       PROGRAM-ID. main-program.
       PROCEDURE DIVISION.
           DISPLAY "Introducing... THE SUB-PROGRAM!".
           CALL "sub-program".
           DISPLAY "That was the sub-program!".
       