      IDENTIFICATION DIVISION.
      PROGRAM-ID. one.
      PROCEDURE DIVISION.
          DISPLAY "It's me! I'm valid".

      IDENTIFICATION DIVISION.
       PROGRAM-ID. two.
       PROCEDURE DIVISION.
           DISPLAY "No don't listen to her, I'm valid!".