       IDENTIFICATION DIVISION.
       PROGRAM-ID. sub-program.
       PROCEDURE DIVISION.
           DISPLAY "Thank you main-program".
           DISPLAY "I am the sub-program.".

       