       IDENTIFICATION DIVISION.
       PROGRAM-ID. Valentine.
       PROCEDURE DIVISION.
           DISPLAY "Happy Valentines Day!".
           DISPLAY "How was your day?".